package examination250617;


public class Examination250617 {
	public static void main(String[] args) {
		
//		【문항1】 커피 생산을 관리하기 위한 서비스를 제작하려고 합니다.
//		시장의 요구에 따라 필요한 만큼의 생산을 계획하는 시스템을 다음의 규칙을 적용하여 구현하세요.
//		1. 생산하려는 커피의 종류를 선택할 수 있게 해주세요
//		2. 커피의 종류에 따라 상세 종류를 선택할 수 있게 해주세요.
//		3. 필요한 경우 더 상세한 내용을 선택할 수 있게 해주세요. 필요없을 경우 생략 가능합니다.
//		4. 각각 선택할 메뉴 표시에 가격이 정해져 있다면 가격도 같이 표시해 주세요
//		5. 선택한 내용을 확인할 수 있게 출력해 주세요.
//		6. 언제나 처음 단계로 돌아갈 수 있는 기능이 필요합니다.
//		7. 언제나 종료할 수 있는 기능이 필요합니다.
		
//		【문항2】 선택한 메뉴들로 이루어진 완제품의 최종 가격을 출력하세요
		
		
		Menu coffee = new Menu();
		coffee.start();
		
	
		
		

		
		
		

	}
}
